_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменДаннымиВФорматеГрандСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_ОбменДаннымиВФорматеГрандСмета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ТерриториальныеРайоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СметнаяПрограммаВыбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьСохранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтборСмет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛокальнаяСмета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_АРПС_ПрефиксыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_АРПС_ПрефиксыОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипНормативногоСборника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыНормативныхСборников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Определитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_Определители</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОтбрасыватьПрефикс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьЗаписиВСправочнике</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РедактироваласьПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СметнаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПрефикса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_АРПС_СоответствияШифров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_АРПС_СоответствияШифров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шифр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироваласьПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СметнаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШифрАРПС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_АРПС_Итоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_АРПС_Итоги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РедактироваласьПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НаименованиеЛимзатратыАРПС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_АРПС_СоответствияЛимЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_АРПС_СоответствияЛимЗатрат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторЛимЗатраты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеЛимзатраты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЛимЗатрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироваласьПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СметнаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеЛимзатратыАРПС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_Файлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменДаннымиВФорматеГрандСмета/Forms/Форма/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

Перем ДокСсылка;
Перем ПрефиксыПрограммы;

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Возврат при получении формы для анализа.
	Если Параметры.Свойство("АвтоТест") Тогда 
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ДатаСметы 		  	= ТекущаяДатаСеанса();
	ЭтаФорма.СметнаяПрограмма 	= Справочники.СМ_СметныеПрограммы.ГрандСмета;
	
	ЗаполнитьНастройкиПользователяПоУмолчанию();

	Если Параметры.Свойство("Загрузка") Тогда
		Если Параметры.Загрузка Тогда
			Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.СтраницаЗагрузка;
			Элементы.СтраницаВыгрузка.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Ключ") Тогда
		Если Параметры.Ключ = "ДеревоСметВыгрузка" Тогда
			Для каждого эл Из Параметры.СписокВыгрузки Цикл
				СтрСмета = Объект.ОтборСмет.Добавить();
				СтрСмета.ЛокальнаяСмета = эл.Значение;
			КонецЦикла;
			Элементы.СтраницаЗагрузка.Видимость = Ложь;
			Элементы.ТаблицыДанных.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Процедура заполняет реквизиты объекта данными из настроек пользователя (значениями по умолчанию).
//
// Параметры:
//     ТекОбъект - Объект, реквизиты которого заполняются.
//     Форма - Контекст формы обработки.
//
&НаСервере
Процедура ЗаполнитьНастройкиПользователяПоУмолчанию()
	ЭтаФорма.Стройка 				= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнаяСтройка");
	ЭтаФорма.Организация = СМ_СметаВызовСервера.ПолучитьНастройкуПользователяПообъектно(ЭтаФорма.Стройка,"ОсновнаяОрганизация");	
	ЭтаФорма.Район = СМ_СметаВызовСервера.ПолучитьНастройкуПользователяПообъектно(ЭтаФорма.Стройка,"ОсновнойРайон");	
	ЭтаФорма.СметноНормативнаяБаза 	= Справочники.СМ_СметноНормативныеБазы.ПолучитьПоРайону(ЭтаФорма.Район);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаКаталога(Файл = Истина)
	
	СведенияФайлов.Очистить();
	Если Файл Тогда	
		Диалог 				= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ФильтрДляДиалога 	= "Гранд смета (*.xml)|*.xml";
		ФильтрДляДиалога 	= ФильтрДляДиалога + "|Все файлы (*.*)|*.*";
		Диалог.Фильтр 		= ФильтрДляДиалога;
		
		// Синхронный вызов
		//Если Диалог.Выбрать() Тогда
		//	КаталогЗагрузки = Диалог.ПолноеИмяФайла;
		//	ОпределитьПервичныеПараметрыФайлов();
		//КонецЕсли;
		
		// Замена на асинхронный вызов
		ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект);
		Диалог.Показать(ОповещениеВыбора);
	Иначе
		Диалог 			= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		Диалог.Фильтр 	= "";
		
		// Синхронный вызов
		//Если Диалог.Выбрать() Тогда
		//	КаталогЗагрузки = Диалог.Каталог;
		//	ОпределитьПервичныеПараметрыФайлов();
		//КонецЕсли;
		
		// Замена на асинхронный вызов
		ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект);
		Диалог.Показать(ОповещениеВыбора);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайла(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			КаталогЗагрузки = ТекЭлемент;
			ОпределитьПервичныеПараметрыФайлов();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузкаКаталогЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СведенияФайлов.Очистить();
	ВыборФайлаКаталога(ИзФайла);
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьПервичныеПараметрыФайлов()
	
	Если (ИзФайла) И ЗначениеЗаполнено(КаталогЗагрузки) Тогда
		Файлик 								= Новый Файл(КаталогЗагрузки);
		Загрузка_ИмяФайла 					= Файлик.ИмяБезРасширения;
		ДвоичныеДанные 						= Новый ДвоичныеДанные(КаталогЗагрузки);
		АдресВременногоХранилища 			= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		Загрузка_ПолныйПуть 				= КаталогЗагрузки;
		Загрузка_АдресВременногоХранилища 	= АдресВременногоХранилища;
		
		НовСвед 									= СведенияФайлов.Добавить();
		НовСвед.Загрузка_ИмяФайла 					= Загрузка_ИмяФайла;
		НовСвед.Загрузка_ПолныйПуть 				= Загрузка_ПолныйПуть;
		НовСвед.Загрузка_АдресВременногоХранилища 	= Загрузка_АдресВременногоХранилища;
	ИначеЕсли Не ИзФайла И ЗначениеЗаполнено(КаталогЗагрузки) Тогда
		
		// Синхронный вызов
		//СписокФайлов = НайтиФайлы(Этаформа.КаталогЗагрузки,"*.*"); 
		//Для Каждого ТекФайл Из СписокФайлов Цикл
		//	Если ТекФайл.ЭтоКаталог() Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	НовСвед 									= СведенияФайлов.Добавить();
		//	НовСвед.Загрузка_ИмяФайла 					= ТекФайл.ИмяБезРасширения;
		//	ДвоичныеДанные 								= Новый ДвоичныеДанные(ТекФайл.ПолноеИмя);
		//	АдресВременногоХранилища 					= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор);
		//	НовСвед.Загрузка_ПолныйПуть 				= ТекФайл.ПолноеИмя;
		//	НовСвед.Загрузка_АдресВременногоХранилища 	= АдресВременногоХранилища;
		//КонецЦикла;
		
		// Замена на асинхронный вызов
		ОповещениеПоиска = Новый ОписаниеОповещения("ВыполнитьПослеПоискаФайлов", ЭтотОбъект);
		НачатьПоискФайлов(ОповещениеПоиска,Этаформа.КаталогЗагрузки,"*.*");
	КонецЕсли;
	СостояниеКнопок = 1;
	ВидимостьКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПоискаФайлов(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	
	Для Каждого ТекФайл Из НайденныеФайлы Цикл
		Если ТекФайл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		НовСвед 									= СведенияФайлов.Добавить();
		НовСвед.Загрузка_ИмяФайла 					= ТекФайл.ИмяБезРасширения;
		ДвоичныеДанные 								= Новый ДвоичныеДанные(ТекФайл.ПолноеИмя);
		АдресВременногоХранилища 					= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор);
		НовСвед.Загрузка_ПолныйПуть 				= ТекФайл.ПолноеИмя;
		НовСвед.Загрузка_АдресВременногоХранилища 	= АдресВременногоХранилища;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.ТаблицыДанных.Видимость = Ложь;
	#Если ВебКлиент Тогда
		Элементы.КаталогЗагрузки = Ложь;
		Элементы.ПутьСохранения.Видимость = Ложь;
	#КонецЕсли
	СтраницаФайлов();
	ПоказатьТаблицыДанныхПриИзменении();
	
	Если ЗначениеЗаполнено(Параметры.ИмяФайла) Тогда
		ИзФайла = Истина;
		ИзФайлаПриИзменении(Неопределено);
		КаталогЗагрузки = Параметры.ИмяФайла; 
		ОпределитьПервичныеПараметрыФайлов();
	КонецЕсли;
	СостояниеКнопок = 1;
	ВидимостьКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТаблицыДанныхПриИзменении()
	
	ТекСтатус = ЭтаФорма.ПоказатьТаблицыДанных;
	
	Элементы.ТаблицыДанных.Видимость 		    = ТекСтатус;
	Элементы.СтраницаЛимЗатраты.Видимость 		= ТекСтатус;
	Элементы.СтраницаАктыСметы.Видимость        = ТекСтатус;
	Элементы.СтраницаИндексы.Видимость          = ТекСтатус;
	Элементы.СтраницаВидыРабот.Видимость 		= ТекСтатус;
	Элементы.СтраницаРазделы.Видимость          = ТекСтатус;
	Элементы.СтраницаПозицииЛС.Видимость        = ТекСтатус;
	Элементы.СтраницаКоэффициенты.Видимость     = ТекСтатус;
	Элементы.СтраницаРесурсы.Видимость          = ТекСтатус;
	Элементы.СтраницаКомментарии.Видимость      = ТекСтатус;
	Элементы.СтраницаПоправки.Видимость         = ТекСтатус;
	Элементы.СтраницаСоставРабот.Видимость      = ТекСтатус;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеФайла(Команда)
	
	ЭтаФорма.СоответствияРесурсов.Очистить();
	ЭтаФорма.СоответствияЛЗ.Очистить();
	ЭтаФорма.СоответствияПрефиксов.Очистить();
	ЭтаФорма.ЗагрузкаДанных 	= Истина;
	Если ИзФайла Тогда
		СведенияФайлов[0].Район = Район;
		СведенияФайлов[0].СметноНормативнаяБаза = СметноНормативнаяБаза;
		СведенияФайлов[0].НомерСметы = НомерСметы;
		СведенияФайлов[0].НаименованиеСметы = НаименованиеСметы;
		//СведенияФайлов[0].Стройка = Стройка;
		Если ЗначениеЗаполнено(Стройка) Тогда
			СведенияФайлов[0].Стройка = Стройка;	
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.КаталогЗагрузки) Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьВыполнениеЗадания",1,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбран файл для загрузки данных!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	Если ИзФайла Тогда
		Район = СведенияФайлов[0].Район;
		СметноНормативнаяБаза = СведенияФайлов[0].СметноНормативнаяБаза;
		НомерСметы = СведенияФайлов[0].НомерСметы;
		НаименованиеСметы = СведенияФайлов[0].НаименованиеСметы;
		Стройка = СведенияФайлов[0].Стройка;
	КонецЕсли;

	ЭтаФорма.ЗагрузкаДанных = Ложь;
	СписокОшибок 			= Новый СписокЗначений;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ДатаСметы) Тогда
		СписокОшибок.Добавить(1,"Не заполнено поле - дата локальной сметы");
	КонецЕсли;

	Если ИзФайла Тогда
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.НомерСметы) Тогда
			СписокОшибок.Добавить(2,"Не заполнено поле - номер локальной сметы");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.НаименованиеСметы) Тогда
			СписокОшибок.Добавить(3,"Не заполнено поле - наименование локальной сметы");
		КонецЕсли;
		
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.Стройка) Тогда
			СписокОшибок.Добавить(6,"Не заполнено поле - стройка");
		КонецЕсли;
		
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.Район) Тогда
			СписокОшибок.Добавить(8,"Не заполнено поле - район");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.СметноНормативнаяБаза) Тогда
			СписокОшибок.Добавить(11,"Не заполнено поле - региональная база");
		КонецЕсли;
	Иначе
		Для Каждого СтрФайл Из СведенияФайлов Цикл
			Если НЕ ЗначениеЗаполнено(СтрФайл.НомерСметы) Тогда
				СписокОшибок.Добавить(2,"Не заполнено поле - номер локальной сметы");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрФайл.НаименованиеСметы) Тогда
				СписокОшибок.Добавить(3,"Не заполнено поле - наименование локальной сметы");
			КонецЕсли;
			
			
			Если НЕ ЗначениеЗаполнено(СтрФайл.Стройка) Тогда
				СписокОшибок.Добавить(6,"Не заполнено поле - стройка");
			КонецЕсли;
			
			
			Если НЕ ЗначениеЗаполнено(СтрФайл.Район) Тогда
				СписокОшибок.Добавить(8,"Не заполнено поле - район");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрФайл.СметноНормативнаяБаза) Тогда
				СписокОшибок.Добавить(11,"Не заполнено поле - региональная база");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Организация) Тогда
		СписокОшибок.Добавить(4,"Не заполнено поле - организация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Заказчик) Тогда
		СписокОшибок.Добавить(5,"Не заполнено поле - заказчик");
	КонецЕсли;

	Если СписокОшибок.Количество() > 0 Тогда
		Для Каждого ТекЭлемент Из СписокОшибок Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + ТекЭлемент.Представление);	
		КонецЦикла;	
		Возврат;
	КонецЕсли;
	
	ЗаписатьСоответствияАРПС();
	
	ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьВыполнениеЗадания", 1, Истина);
	

КонецПроцедуры

&НаСервере
Процедура ЗаписатьСоответствияАРПС()
	
	Если ЭтаФорма.СоответствияПрефиксов.Количество()>0 Тогда
		Для Каждого Стр Из ЭтаФорма.СоответствияПрефиксов Цикл
			РС_Префиксы = РегистрыСведений.СМ_АРПС_ПрефиксыОбъектов.СоздатьНаборЗаписей();
			РС_Префиксы.Отбор.СметнаяПрограмма.Установить(ЭтаФорма.СметнаяПрограмма);
			РС_Префиксы.Отбор.СтрокаПрефикса.Установить(Стр.СтрокаПрефикса); 
			РС_Префиксы.Прочитать(); 
			Если РС_Префиксы.Количество() = 0 Тогда
				НоваяЗапись								= РС_Префиксы.Добавить();
				НоваяЗапись.СметнаяПрограмма 			= ЭтаФорма.СметнаяПрограмма;
				НоваяЗапись.СтрокаПрефикса 				= Стр.СтрокаПрефикса;
				НоваяЗапись.ТипНормативногоСборника 	= Стр.ТипНормативногоСборника;
				НоваяЗапись.Определитель 				= Стр.Определитель;
				НоваяЗапись.ВидРесурса 					= Стр.ВидРесурса;
				НоваяЗапись.СоздаватьЗаписиВСправочнике = стр.СоздаватьЗаписиВСправочнике;
				НоваяЗапись.НеОтбрасыватьПрефикс = стр.НеОтбрасыватьПрефикс;
		
				НоваяЗапись.РедактироваласьПользователем = Истина;
				РС_Префиксы.Записать(Ложь);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Для Каждого Стр Из ЭтаФорма.СоответствияРесурсов Цикл
		Если Стр.СсылкаВБазе.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		РС_Шифр = РегистрыСведений.СМ_АРПС_СоответствияШифров.СоздатьНаборЗаписей();
		РС_Шифр.Отбор.СметнаяПрограмма.Установить(ЭтаФорма.СметнаяПрограмма);
		РС_Шифр.Отбор.ШифрАРПС.Установить(Стр.КодРесурса); 
		РС_Шифр.Прочитать(); 
		
		Если РС_Шифр.Количество() = 0 Тогда
			НоваяЗапись									= РС_Шифр.Добавить();
			НоваяЗапись.СметнаяПрограмма 				= ЭтаФорма.СметнаяПрограмма;
			НоваяЗапись.ШифрАРПС 						= Стр.КодРесурса;
			НоваяЗапись.Шифр 							= Стр.СсылкаВБазе.Код;
			НоваяЗапись.Ресурс 							= Стр.СсылкаВБазе;
			НоваяЗапись.РедактироваласьПользователем 	= Истина;
			РС_Шифр.Записать(Ложь);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Стр Из ЭтаФорма.СоответствияЛЗ Цикл
		
		Если Стр.НеЯвляетсяЛЗ Тогда
			РС_ЛимЗатрат = РегистрыСведений.СМ_АРПС_Итоги.СоздатьНаборЗаписей();
			РС_ЛимЗатрат.Отбор.НаименованиеЛимзатратыАРПС.Установить(Стр.НаименованиеЛЗ);
			РС_ЛимЗатрат.Прочитать(); 
			Если РС_ЛимЗатрат.Количество() = 0 Тогда
				НоваяЗапись									= РС_ЛимЗатрат.Добавить();
				НоваяЗапись.НаименованиеЛимзатратыАРПС 		= Стр.НаименованиеЛЗ;
				НоваяЗапись.РедактироваласьПользователем 	= Истина;
				РС_ЛимЗатрат.Записать(Ложь);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если Стр.СсылкаВБазе.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		РС_ЛимЗатрат = РегистрыСведений.СМ_АРПС_СоответствияЛимЗатрат.СоздатьНаборЗаписей();
		РС_ЛимЗатрат.Отбор.СметнаяПрограмма.Установить(ЭтаФорма.СметнаяПрограмма);
		РС_ЛимЗатрат.Отбор.НаименованиеЛимзатратыАРПС.Установить(Стр.НаименованиеЛЗ);
		РС_ЛимЗатрат.Прочитать(); 
		Если РС_ЛимЗатрат.Количество() = 0 Тогда
			НоваяЗапись 								= РС_ЛимЗатрат.Добавить();
			НоваяЗапись.СметнаяПрограмма 				= ЭтаФорма.СметнаяПрограмма;
			НоваяЗапись.НаименованиеЛимзатратыАРПС 		= Стр.НаименованиеЛЗ;
			НоваяЗапись.ИдентификаторЛимЗатраты 		= Стр.СсылкаВБазе.Идентификатор;
			НоваяЗапись.ЛимЗатрата 						= Стр.СсылкаВБазе;
			НоваяЗапись.НаименованиеЛимзатраты 			= Стр.СсылкаВБазе.Наименование;
			НоваяЗапись.РедактироваласьПользователем 	= Истина;
			РС_ЛимЗатрат.Записать(Ложь);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция глВывестиТЗНаФорму(тРезультат, текФорма, имяЭлементаРазмещения, префиксРеквизита = "автоРеквизит", ИмяРодителя = неопределено, мПроцедур = неопределено, видимостьКПанели = ложь)

	Попытка  
		//  отображение произвольной таблицы - результата запроса на форме
	    МассивДобавляемыхРеквизитов = Новый Массив;
	    МассивУдаляемыхРеквизитов 	= Новый Массив;
				
		Для Каждого Колонка Из тРезультат.Колонки Цикл
			//  установка имени колонки по заголовку
			Если Колонка.Заголовок <> "" Тогда 
				ЗаголовокКолонки = Колонка.Заголовок;
			Иначе 
				ЗаголовокКолонки = Колонка.Имя;
			КонецЕсли; 
	        МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, имяЭлементаРазмещения, ЗаголовокКолонки));
			Если текФорма.Элементы.Найти(префиксРеквизита+"_" + Колонка.Имя) <> Неопределено Тогда
	            МассивУдаляемыхРеквизитов.Добавить(нрег(имяЭлементаРазмещения+"." + Колонка.Имя));
	        КонецЕсли;
		КонецЦикла;
		
		//  Если на форме остались реквизиты "автоРеквизита" (при выводе различной структуры), то удалим и их.
		Попытка 
			МассивУдаляемыхРеквизитов2 = Новый Массив;
			Для каждого элем Из текФорма.Элементы[префиксРеквизита].ПодчиненныеЭлементы Цикл
				имяТекРеквизита = стрЗаменить(элем.Имя,префиксРеквизита+"_","");
				МассивУдаляемыхРеквизитов2.Добавить(нрег(имяЭлементаРазмещения+"." + имяТекРеквизита));  
			КонецЦикла;
			  			
			//  добавим необходимые реквизиты (отсуствующие) в МассивУдаляемыхРеквизитов
			Для каждого недостающий Из МассивУдаляемыхРеквизитов2 Цикл 
				Если МассивУдаляемыхРеквизитов.Найти(недостающий) = неопределено Тогда 
					МассивУдаляемыхРеквизитов.Добавить(недостающий); 
				КонецЕсли;  
			КонецЦикла; 
		Исключение 	
			Событие = НСтр("ru = 'Исключение Гранд-смета'");
			СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
		КонецПопытки;
 
	    текФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов,МассивУдаляемыхРеквизитов);      
	    
		ЭлементФормы = текФорма.Элементы.Найти(префиксРеквизита);
		Если ЭлементФормы <> Неопределено Тогда
			текФорма.Элементы.Удалить(ЭлементФормы);
		КонецЕсли;
		
		// Зайцев 22072015
		Родитель = текФорма.Элементы.Найти(ИмяРодителя);
		Если Родитель = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не удалось найти элемент формы %1'"),ИмяРодителя));
			Возврат Ложь;
		КонецЕсли;
		
		//  Создание элемента "Табличное поле" на форме
		ЭлементДерево 				= текФорма.Элементы.Добавить(префиксРеквизита,Тип("ТаблицаФормы"), Родитель);
		ЭлементДерево.ПутьКДанным 	= имяЭлементаРазмещения;
		ЭлементДерево.Отображение 	= ОтображениеТаблицы.Дерево;
		Если мПроцедур <> неопределено Тогда 
			Для каждого новПроцедура Из мПроцедур Цикл 
				ЭлементДерево.УстановитьДействие(новПроцедура,новПроцедура+"АвтоРеквизитов");  
			КонецЦикла;  
		КонецЕсли; 
		
		// ЭлементДерево.КоманднаяПанель.Доступность = ложь;		
		Если НЕ видимостьКПанели Тогда 
			ЭлементДерево.ПоложениеКоманднойПанели  = положениеКоманднойПанелиЭлементаФормы.Нет; 
		КонецЕсли; 		
			
		//  Создание колонок для элемента "Табличное поле"	
		Для Каждого Колонка Из тРезультат.Колонки Цикл
			НовыйЭлемент 	 			= ТекФорма.Элементы.Добавить(префиксРеквизита+"_" + Колонка.Имя, Тип("ПолеФормы"), ЭлементДерево);
			НовыйЭлемент.ПутьКДанным 	= ИмяЭлементаРазмещения+"." + Колонка.Имя;

			Если Колонка.ТипЗначения.СодержитТип(Тип("Булево")) Тогда 
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			Иначе
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			КонецЕсли;
			
		КонецЦикла; 
		
		Попытка 
			Для каждого Элем Из ЭлементДерево.ПодчиненныеЭлементы Цикл 
				//  выявим числовые поля и сделаем их значительно уже текстовых
				стрПути 	= элем.ПутьКДанным;
				поз 		= найти(стрПути,".");			
				имяКолонки 	= прав(стрПути,стрДлина(стрПути)-поз);
				типТекущейКолонки = тРезультат.Колонки[имяКолонки].ТипЗначения;
				Если типТекущейКолонки.СодержитТип(тип("Строка")) Тогда 
					элем.Ширина = 20;
				ИначеЕсли типТекущейКолонки.СодержитТип(тип("Число")) Тогда
					элем.Ширина = 3;
				КонецЕсли; 
			КонецЦикла;  
		Исключение 
			Событие = НСтр("ru = 'Исключение Гранд-смета'");
			СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
		КонецПопытки;
		
		Возврат истина;			  
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки()); 
	    Возврат ложь;
	КонецПопытки;

КонецФункции //  глВывестиТЗНаФорму()

&НаКлиенте
Процедура Подключаемый_ЗапуститьВыполнениеЗадания()
	
	Если ЭтаФорма.ЗагрузкаДанных Тогда
		Результат 				= ЗапуститьЗадание();
		ИдентификаторЗадания 	= Результат.ИдентификаторЗадания;
		АдресХранилища 		 	= Результат.АдресХранилища;
	Иначе
		Результат 				= ЗапуститьЗаданиеДокументы();	
		ИдентификаторЗадания 	= Результат.ИдентификаторЗадания;
		АдресХранилища 		 	= Результат.АдресХранилища	
	КонецЕсли;	
		
	Если Результат.ЗаданиеВыполнено Тогда
		ОбработкаРезультата();
		Если ЭтаФорма.ЗагрузкаДанных Тогда
			Если ЭтаФорма.СоответствияЛЗ.Количество() > 0 ИЛИ ЭтаФорма.СоответствияРесурсов.Количество() > 0 ИЛИ ЭтаФорма.СоответствияПрефиксов.Количество() > 0 Тогда
				ПоказатьПредупреждение(,НСтр("ru='Требуется заполнить соответствия ресурсов, лимитированных затрат и префиксов..'"));
				Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.ТаблицыДанных.Видимость = Истина;
				Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.ТаблицыДанных;
				Если ЭтаФорма.СоответствияПрефиксов.Количество() > 0 Тогда 
					Элементы.СтраницыТаблиц.ТекущаяСтраница = Элементы.СтраницыТаблиц.ПодчиненныеЭлементы.СтраницаСоответствияПрефиксов;
				ИначеЕсли ЭтаФорма.СоответствияРесурсов.Количество() > 0 Тогда
					Элементы.СтраницыТаблиц.ТекущаяСтраница = Элементы.СтраницыТаблиц.ПодчиненныеЭлементы.СтраницаСоответствияРесурсов;					
				ИначеЕсли ЭтаФорма.СоответствияЛЗ.Количество() > 0 Тогда
					Элементы.СтраницыТаблиц.ТекущаяСтраница = Элементы.СтраницыТаблиц.ПодчиненныеЭлементы.СтраницаСоответсвияЛЗ;
				КонецЕсли;
			Иначе
				Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.ТаблицыДанных.Видимость = Ложь;
			КонецЕсли;
			ВидимостьСтраницСоответствия();
			СостояниеКнопок = 2;
			ВидимостьКнопок();
		Иначе
			Если Результат.Свойство("ТабСообщения") Тогда
				Для Каждого ТекСтрока Из Результат.ТабСообщения Цикл
					Событие = НСтр("ru = 'Загрузка Гранд-смета'");
					СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие,Ложь,ТекСтрока.ТекстСообщения);
				КонецЦикла;
			КонецЕсли;
			СостояниеКнопок = 3;
			ВидимостьКнопок();
			Оповестить("ОбновитьДеревоСмет");
			Оповестить("ИмпортШаблон",Загрузка_СозданныйДокумент);
		КонецЕсли;	
	Иначе
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, Результат.ИдентификаторЗадания);
	КонецЕсли;  		
		
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ФормаДлительнойОперации.Открыта() И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
				ОбработкаРезультата();
				Если ЭтаФорма.ЗагрузкаДанных Тогда
					Если ЭтаФорма.СоответствияЛЗ.Количество() > 0 ИЛИ ЭтаФорма.СоответствияРесурсов.Количество() > 0 ИЛИ ЭтаФорма.СоответствияПрефиксов.Количество() > 0 Тогда
						ПоказатьПредупреждение(,НСтр("ru='Требуется заполнить соответствия ресурсов, лимитированных затрат и префиксов..'"));
						Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.ТаблицыДанных.Видимость = Истина;
						Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.ТаблицыДанных;
						Если ЭтаФорма.СоответствияПрефиксов.Количество() > 0 Тогда 
							Элементы.СтраницыТаблиц.ТекущаяСтраница = Элементы.СтраницыТаблиц.ПодчиненныеЭлементы.СтраницаСоответствияПрефиксов;
						ИначеЕсли ЭтаФорма.СоответствияРесурсов.Количество() > 0 Тогда
							Элементы.СтраницыТаблиц.ТекущаяСтраница = Элементы.СтраницыТаблиц.ПодчиненныеЭлементы.СтраницаСоответствияРесурсов;					
						ИначеЕсли ЭтаФорма.СоответствияЛЗ.Количество() > 0 Тогда
							Элементы.СтраницыТаблиц.ТекущаяСтраница = Элементы.СтраницыТаблиц.ПодчиненныеЭлементы.СтраницаСоответсвияЛЗ;
						КонецЕсли;
					Иначе
						Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.ТаблицыДанных.Видимость = Ложь;
					КонецЕсли;
					ВидимостьСтраницСоответствия();
					СостояниеКнопок = 2;
					ВидимостьКнопок();
				Иначе
					Оповестить("ОбновитьДеревоСмет");
					Оповестить("ИмпортШаблон",Загрузка_СозданныйДокумент);
					СостояниеКнопок = 3;
					ВидимостьКнопок();
				КонецЕсли;	
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания",ПараметрыОбработчикаОжидания.ТекущийИнтервал,Истина);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ЗаписатьИсключениеНаСервере(ПредставлениеОшибки);
		ПоказатьПредупреждение(,НСтр("ru='Произошла ошибка. Подробности в журнале регистрации.'"));
	КонецПопытки;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервере
Процедура ЗаписатьИсключениеНаСервере(Знач ПредставлениеОшибки)
	
	Событие = НСтр("ru = 'Ошибка в задании'");
	ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ПредставлениеОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьСтраницСоответствия()
	
	Элементы.СтраницаСоответствияПрефиксов.Видимость 	= (ЭтаФорма.СоответствияПрефиксов.Количество() > 0);
	Элементы.СтраницаСоответствияРесурсов.Видимость  	= (ЭтаФорма.СоответствияРесурсов.Количество() > 0);					
	Элементы.СтраницаСоответсвияЛЗ.Видимость  			= (ЭтаФорма.СоответствияЛЗ.Количество() > 0);
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьЗадание()
	
	// Таблица локальных смет
	ТабДокументов = Новый ТаблицаЗначений;
	ТабДокументов.Колонки.Добавить("НаименованиеСметы");
	ТабДокументов.Колонки.Добавить("ИДсметы");
	ТабДокументов.Колонки.Добавить("НомерСметы");
	ТабДокументов.Колонки.Добавить("Акт");
	ТабДокументов.Колонки.Добавить("ИДакта");
	ТабДокументов.Колонки.Добавить("НомерАкта");
	ТабДокументов.Колонки.Добавить("SysID");
	ТабДокументов.Колонки.Добавить("ДатаАкта");
	ТабДокументов.Колонки.Добавить("ПериодОт");
	ТабДокументов.Колонки.Добавить("ПериодДо");
	// RegionInfo
	ТабДокументов.Колонки.Добавить("RegionName");
	ТабДокументов.Колонки.Добавить("RegionID");
	ТабДокументов.Колонки.Добавить("Zone84ID");
	ТабДокументов.Колонки.Добавить("Zone84Name");
	ТабДокументов.Колонки.Добавить("Zone01ID");
	ТабДокументов.Колонки.Добавить("Zone01Name");
	// Parameters
	ТабДокументов.Колонки.Добавить("Options");
	ТабДокументов.Колонки.Добавить("BasePrices");
	ТабДокументов.Колонки.Добавить("BaseCalcVrs");
	ТабДокументов.Колонки.Добавить("BlockRoundMode");
	ТабДокументов.Колонки.Добавить("TempZone");
	ТабДокументов.Колонки.Добавить("MatRoundMode");
	ТабДокументов.Колонки.Добавить("MatDigits");
	ТабДокументов.Колонки.Добавить("ItogOptions");
	ТабДокументов.Колонки.Добавить("FirstItogItem");
	ТабДокументов.Колонки.Добавить("ItogExpandTo");
	ТабДокументов.Колонки.Добавить("TzDigits");
	ТабДокументов.Колонки.Добавить("PosKDigits");
	ТабДокументов.Колонки.Добавить("MultKPosCalcMode");
	// Коэффициенты НР и СП / Поправочные / УСН.
	// CommonNK - коэффициенты НР.
	ТабДокументов.Колонки.Добавить("NK_MethodKI");
	ТабДокументов.Колонки.Добавить("NK_ActiveItems");
	// CommonPK - коэффициенты СП.
	ТабДокументов.Колонки.Добавить("PK_MethodKI");
	ТабДокументов.Колонки.Добавить("PK_ActiveItems");

	// ********************************
	// Таблица индексов / коэффициентов
	ТабИндексов = Новый ТаблицаЗначений;
	ТабИндексов.Колонки.Добавить("ИДсметы"); 	// ИДсметы	
	ТабИндексов.Колонки.Добавить("Caption"); 	// Caption
	ТабИндексов.Колонки.Добавить("Code");       // Code
	ТабИндексов.Колонки.Добавить("OZ");        	// OZ
	ТабИндексов.Колонки.Добавить("EM");         // EM
	ТабИндексов.Колонки.Добавить("ZM");         // ZM
	ТабИндексов.Колонки.Добавить("MT");         // MT
	ТабИндексов.Колонки.Добавить("Formula");    // Formula
	ТабИндексов.Колонки.Добавить("SMR");        // SMR
	ТабИндексов.Колонки.Добавить("УровеньДокумента");  
	ТабИндексов.Колонки.Добавить("ИндексыАкта");  // Признак что коэффициент относится к акту
	ТабИндексов.Колонки.Добавить("ИдАкта");       // Ид акта
	
	// ********************************
	// Таблица разделов ЛС
	ТабРазделов = Новый ТаблицаЗначений;
	ТабРазделов.Колонки.Добавить("ИДсметы"); 	// ИДсметы
	ТабРазделов.Колонки.Добавить("НаименованиеРаздела");  	// Caption
	ТабРазделов.Колонки.Добавить("НаименованиеПодраздела");	// Header Caption
	ТабРазделов.Колонки.Добавить("SysID");                  // SysID 
	ТабРазделов.Колонки.Добавить("РазделСсылка");           // Ссылка на раздел
	ТабРазделов.Колонки.Добавить("ВерхнийРаздел");          // Ссылка на верхний раздел
	ТабРазделов.Колонки.Добавить("Подраздел");              // Признак подраздела
	ТабРазделов.Колонки.Добавить("IndexCode");              // код индексов
	
	// ********************************
	// Таблица позиций ЛС
	ТабПозицийЛС = Новый ТаблицаЗначений;
	ТабПозицийЛС.Колонки.Добавить("ИДсметы"); 	// ИДсметы	
	ТабПозицийЛС.Колонки.Добавить("Наименование");   		 // Caption
	ТабПозицийЛС.Колонки.Добавить("ПорядковыйНомерВСмете");  // Number
	ТабПозицийЛС.Колонки.Добавить("Идентификатор");			 // Identifier
	ТабПозицийЛС.Колонки.Добавить("SysID");				 	 // SysID
	ТабПозицийЛС.Колонки.Добавить("Префикс");
	ТабПозицийЛС.Колонки.Добавить("ШифрРасценки");           // Code
	ТабПозицийЛС.Колонки.Добавить("Измеритель");             // Units
	ТабПозицийЛС.Колонки.Добавить("Версия");                 // DBComment
	ТабПозицийЛС.Колонки.Добавить("ВидРабот");               // Vr2001
	ТабПозицийЛС.Колонки.Добавить("УровеньЦен");             // PriceLevel
	ТабПозицийЛС.Колонки.Добавить("IndexCode");
	ТабПозицийЛС.Колонки.Добавить("PzSync");
	ТабПозицийЛС.Колонки.Добавить("DBFlags");
	ТабПозицийЛС.Колонки.Добавить("Options");
	ТабПозицийЛС.Колонки.Добавить("Comment");
	ТабПозицийЛС.Колонки.Добавить("ОбъемРабот");             // Quantity
	ТабПозицийЛС.Колонки.Добавить("Fx");                     // Quantity FX
	ТабПозицийЛС.Колонки.Добавить("KUnit");					 // Quantity KUnit
	ТабПозицийЛС.Колонки.Добавить("Result");                 // Quantity Res
	ТабПозицийЛС.Колонки.Добавить("ПрямыеЗатраты");          // PZ
	ТабПозицийЛС.Колонки.Добавить("ОсновнаяЗарплата");       //	OZ
	ТабПозицийЛС.Колонки.Добавить("ЭксплуатацияМашин");      // EM
	ТабПозицийЛС.Колонки.Добавить("ЗарплатаМашинистов");     // ZM
	ТабПозицийЛС.Колонки.Добавить("СтоимостьМатериалов");    // MT
	
	ТабПозицийЛС.Колонки.Добавить("ТекОсновнаяЗарплата");       	// OZ
	ТабПозицийЛС.Колонки.Добавить("ТекЭксплуатацияМашин");      	// EM
	ТабПозицийЛС.Колонки.Добавить("ТекЗарплатаМашинистов");     	// ZM
	ТабПозицийЛС.Колонки.Добавить("ТекСтоимостьМатериалов");    	// MT
	ТабПозицийЛС.Колонки.Добавить("ФормулаТекОсновнаяЗарплата");    // OZ
	ТабПозицийЛС.Колонки.Добавить("ФормулаТекЭксплуатацияМашин");   // EM
	ТабПозицийЛС.Колонки.Добавить("ФормулаТекЗарплатаМашинистов");  // ZM
	ТабПозицийЛС.Колонки.Добавить("ФормулаТекСтоимостьМатериалов"); // MT
	
	ТабПозицийЛС.Колонки.Добавить("Value");					 		// Value
	ТабПозицийЛС.Колонки.Добавить("ValueТек");						// Value
	ТабПозицийЛС.Колонки.Добавить("ItemFlags");					 	// Value
	ТабПозицийЛС.Колонки.Добавить("НаименованиеРаздела");
	ТабПозицийЛС.Колонки.Добавить("ФормулаСМ");
	ТабПозицийЛС.Колонки.Добавить("ИдРаздела");
	ТабПозицийЛС.Колонки.Добавить("Определитель");
	ТабПозицийЛС.Колонки.Добавить("ТипНормативныхСборников");
	ТабПозицийЛС.Колонки.Добавить("КоэффициентКНРНаРемонтБазисный");    // NKB
	ТабПозицийЛС.Колонки.Добавить("КоэффициентКСПНаРемонтБазисный");    // PNB
	ТабПозицийЛС.Колонки.Добавить("КоэффициентКНРНаРемонтТекущий"); 	// NKI
	ТабПозицийЛС.Колонки.Добавить("КоэффициентКСПНаРемонтТекущий"); 	// PKI
	ТабПозицийЛС.Колонки.Добавить("NKR");                    			// NKR
	ТабПозицийЛС.Колонки.Добавить("PKR");                    			// PKR 
	ТабПозицийЛС.Колонки.Добавить("Акт");                    			
	ТабПозицийЛС.Колонки.Добавить("ИДакта"); 
	ТабПозицийЛС.Колонки.Добавить("ПозицияСсылка"); 
	// Коэффициенты НР и СП / Поправочные / УСН.
	// CommonNK - КоэффициентКНРУСНТекущий.
	ТабПозицийЛС.Колонки.Добавить("NK_MethodKI");
	// CommonPK - КоэффициентКСПУСНТекущий.
	ТабПозицийЛС.Колонки.Добавить("PK_MethodKI");
	// ******************************************
	// Таблица ресурсов
	ТабРесурсов = Новый ТаблицаЗначений;
	ТабРесурсов.Колонки.Добавить("Наименование");    		// Caption
	ТабРесурсов.Колонки.Добавить("ВидРесурса");             
	ТабРесурсов.Колонки.Добавить("КодРесурса");             // Code
	ТабРесурсов.Колонки.Добавить("ИдПозиции");				
	ТабРесурсов.Колонки.Добавить("ЕдиницаИзмерения");       // Units
	ТабРесурсов.Колонки.Добавить("НормаРасхода");           // Quantity
	ТабРесурсов.Колонки.Добавить("Атрибуты");               // Attribs
	ТабРесурсов.Колонки.Добавить("WorkClass");              // WorkClass
    ТабРесурсов.Колонки.Добавить("Value");					// Значение базисной цены 
	ТабРесурсов.Колонки.Добавить("ЗарплатаМашинистов");		// ZM
	ТабРесурсов.Колонки.Добавить("ValueТек");				// Значение текущей цены 
	ТабРесурсов.Колонки.Добавить("ТекущаяЗарплатаМашинистов");		// ZM
	ТабРесурсов.Колонки.Добавить("Identifier");				// Identifier
	ТабРесурсов.Колонки.Добавить("Options");				// Options
	ТабРесурсов.Колонки.Добавить("Replaced");				// Replaced
	ТабРесурсов.Колонки.Добавить("СсылкаВБазе");			
	ТабРесурсов.Колонки.Добавить("Замененный");
	ТабРесурсов.Колонки.Добавить("НеОтбрасыватьПрефикс");
	ТабРесурсов.Колонки.Добавить("СоздаватьЗаписиВСправочнике");
    ТабРесурсов.Колонки.Добавить("Акт");
	ТабРесурсов.Колонки.Добавить("ИДакта");
	
	// ******************************************
	// Таблица лимитированных затрат
	ТабЛимЗатраты = Новый ТаблицаЗначений;
	ТабЛимЗатраты.Колонки.Добавить("ИДсметы");				// ИДсметы
	ТабЛимЗатраты.Колонки.Добавить("ИДакта");				// ИДакта
	ТабЛимЗатраты.Колонки.Добавить("Наименование");			// Caption
	ТабЛимЗатраты.Колонки.Добавить("Глава");                // Glava
	ТабЛимЗатраты.Колонки.Добавить("Значение");             // Value
	ТабЛимЗатраты.Колонки.Добавить("Уровень");              // Level
	ТабЛимЗатраты.Колонки.Добавить("Опции");                // Options
	ТабЛимЗатраты.Колонки.Добавить("СсылкаВБазе");		
	ТабЛимЗатраты.Колонки.Добавить("НеЯвляетсяЛЗ");	
	ТабЛимЗатраты.Колонки.Добавить("Акт");
	
	// ******************************************
	// Таблица видов работ 
	ТабВидовРабот = Новый ТаблицаЗначений;
	ТабВидовРабот.Колонки.Добавить("ИДсметы");							// ИДсметы
	ТабВидовРабот.Колонки.Добавить("Наименование");						// Caption
	ТабВидовРабот.Колонки.Добавить("Ид");								// ID
	ТабВидовРабот.Колонки.Добавить("ИдГруппаРабот");					// ID группы, Для определения коэффициентов, относящихся к нескольким группам работ
	ТабВидовРабот.Колонки.Добавить("НакладныеРасходыБазисные");   		// Nacl
	ТабВидовРабот.Колонки.Добавить("НакладныеРасходыТекущие"); 			// NaclCurr
	ТабВидовРабот.Колонки.Добавить("NaclMask");        					// NaclMask
	ТабВидовРабот.Колонки.Добавить("СметнаяПрибыльБазисные");			// Plan
	ТабВидовРабот.Колонки.Добавить("СметнаяПрибыльТекущие");       		// PlanCurr
	ТабВидовРабот.Колонки.Добавить("PlanMask");         				// PlanMask
	ТабВидовРабот.Колонки.Добавить("OsColumn");         				// OsColumn
	ТабВидовРабот.Колонки.Добавить("КоэффициентКНРНаРемонтБазисный"); 	// NKB
	ТабВидовРабот.Колонки.Добавить("КоэффициентКСПНаРемонтБазисный"); 	// PNB
	ТабВидовРабот.Колонки.Добавить("КоэффициентКНРНаРемонтТекущий"); 	// NKI
	ТабВидовРабот.Колонки.Добавить("КоэффициентКСПНаРемонтТекущий"); 	// PKI
	ТабВидовРабот.Колонки.Добавить("NKR");         						// NKR
	ТабВидовРабот.Колонки.Добавить("PKR");         						// PKR

	// ******************************************
	// Таблица Поправки позиций по тех. частям
	ТабПоправки = Новый ТаблицаЗначений;
	ТабПоправки.Колонки.Добавить("ИДсметы");			// ИДсметы
	ТабПоправки.Колонки.Добавить("УсловияПрименения");  // Caption
	ТабПоправки.Колонки.Добавить("КоэффициентОЗ");     	// Value_OZ
	ТабПоправки.Колонки.Добавить("КоэффициентЭМ");      // Value_EM 
	ТабПоправки.Колонки.Добавить("КоэффициентСМ");      // Value_MT
	ТабПоправки.Колонки.Добавить("КоэффициентZM");      // Value_ZT
	ТабПоправки.Колонки.Добавить("КоэффициентPZ");      // Value_PZ
	ТабПоправки.Колонки.Добавить("Опции");				// Options
	ТабПоправки.Колонки.Добавить("Уровень");			// Level
	ТабПоправки.Колонки.Добавить("ВсеВидыРабот");		// AllVidRabs
	ТабПоправки.Колонки.Добавить("ВсеРазделы");			// AllChapters
	ТабПоправки.Колонки.Добавить("Разделы");			// ChaptersLinks
	ТабПоправки.Колонки.Добавить("ИдПозиции");			// Ид позиции ЛС
	ТабПоправки.Колонки.Добавить("ГруппыРабот");		// VrGroupsLinks
//	ТабПоправки.Колонки.Добавить("ВидыРабот");			// VrGroupsLinks
	ТабПоправки.Колонки.Добавить("ВидыРабот");			// VrsLinks
	
	// ******************************************
	// Таблица состав работ
	ТабРаботы = Новый ТаблицаЗначений;
	ТабРаботы.Колонки.Добавить("ИДсметы");				// ИДсметы
	ТабРаботы.Колонки.Добавить("НаименованиеРаботы");   // Caption
	ТабРаботы.Колонки.Добавить("ИдПозиции");	

	// ******************************************
	// Таблица подписи
	ТабПодписи = Новый ТаблицаЗначений;
	ТабПодписи.Колонки.Добавить("ИДсметы");	// ИДсметы
	ТабПодписи.Колонки.Добавить("ИДакта");	// ИДакта
	ТабПодписи.Колонки.Добавить("Статус");  // Caption
	ТабПодписи.Колонки.Добавить("ФИО"); 	// Value	
	ТабПодписи.Колонки.Добавить("Акт"); 	

	ТекОрганизация 	= ЭтаФорма.Организация;
	ТекРайон		= ЭтаФорма.Район;
	
	ТабФайлы = СведенияФайлов.Выгрузить();
	
	Возврат Обработки.СМ_ОбменДаннымиВФорматеГрандСмета.ЗапуститьЗагрузкаГрандСмета(ТабФайлы,ЭтаФорма,ТабДокументов,ТабИндексов,ТабРазделов,ТабПозицийЛС,ТабРесурсов,ТабЛимЗатраты,ТабВидовРабот,ТабПоправки,ТабРаботы,ТабПодписи);			
	
КонецФункции

&НаСервере
Функция ЗапуститьЗаданиеДокументы()

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТабДокументов",РеквизитФормыВЗначение("ДокументыАктСмета"));
	СтруктураПараметров.Вставить("ТабИндексов",РеквизитФормыВЗначение("Индексы"));
	СтруктураПараметров.Вставить("ТабРазделов",РеквизитФормыВЗначение("Разделы"));
	СтруктураПараметров.Вставить("ТабПозицийЛС",РеквизитФормыВЗначение("ПозицииЛС"));
	СтруктураПараметров.Вставить("ТабРесурсов",РеквизитФормыВЗначение("Ресурсы"));
	СтруктураПараметров.Вставить("ТабЛимЗатраты",РеквизитФормыВЗначение("ЛимЗатраты"));
	СтруктураПараметров.Вставить("ТабВидовРабот",РеквизитФормыВЗначение("ВидыРабот"));
	СтруктураПараметров.Вставить("ТабПоправки",РеквизитФормыВЗначение("КоэффициентыПоправки"));
	СтруктураПараметров.Вставить("ТабРаботы", РеквизитФормыВЗначение("СоставРабот"));
	СтруктураПараметров.Вставить("ТабСоответствияПрефиксов",РеквизитФормыВЗначение("СоответствияПрефиксов"));
	СтруктураПараметров.Вставить("ТабСоответствияРесурсов",РеквизитФормыВЗначение("СоответствияРесурсов"));
	СтруктураПараметров.Вставить("ТабСоответствияЛЗ",РеквизитФормыВЗначение("СоответствияЛЗ"));
	СтруктураПараметров.Вставить("ТабФайлов",РеквизитФормыВЗначение("СведенияФайлов"));
	СтруктураПараметров.Вставить("ТабПодписи",РеквизитФормыВЗначение("ТаблицаПодписи"));
	
	Возврат Обработки.СМ_ОбменДаннымиВФорматеГрандСмета.ЗапуститьСозданиеДокументовГрандСмета(ЭтаФорма,СтруктураПараметров);			
	
КонецФункции

&НаСервере
Процедура ОбработкаРезультата()
	
	Для Каждого Стр Из СведенияФайлов Цикл
		Запись = РегистрыСведений.СМ_Файлы.Выбрать(Новый Структура("ИмяФайла",Стр.Загрузка_ПолныйПуть)); 
		Если Запись.Следующий() Тогда
			Запись.ПолучитьМенеджерЗаписи().Удалить();
		КонецЕсли;
	КонецЦикла;

	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.ЗагрузкаДанных Тогда
		//  Вывод таблицы документов ЛС на форму
		Если глВывестиТЗНаФорму(РезультатВыполнения.ТабДокументов,ЭтаФорма,"ДокументыАктСмета","ТабДок","СтраницаАктыСметы") Тогда 
			ЗначениеВРеквизитФормы(РезультатВыполнения.ТабДокументов,"ДокументыАктСмета");
		КонецЕсли; 
		
		// Вывод таблицы индексов на форму
		Если глВывестиТЗНаФорму(РезультатВыполнения.ТабИндексов,ЭтаФорма,"Индексы","ТабИндексы","СтраницаИндексы") Тогда 
			ЗначениеВРеквизитФормы(РезультатВыполнения.ТабИндексов,"Индексы");
		КонецЕсли; 
		
		//  Вывод таблицы позиций на форму
		Если глВывестиТЗНаФорму(РезультатВыполнения.ТабПозицийЛС,ЭтаФорма,"ПозицииЛС","ТабПоз","СтраницаПозицииЛС") Тогда 
			ЗначениеВРеквизитФормы(РезультатВыполнения.ТабПозицийЛС,"ПозицииЛС");
		КонецЕсли; 
		
		//  Вывод таблицы разделов на форму
		Если глВывестиТЗНаФорму(РезультатВыполнения.ТабРазделов,ЭтаФорма,"Разделы","ТабРазделы","СтраницаРазделы") Тогда 
			ЗначениеВРеквизитФормы(РезультатВыполнения.ТабРазделов,"Разделы");
		КонецЕсли; 
		
		//  Вывод таблицы ресурсов на форму
		Если глВывестиТЗНаФорму(РезультатВыполнения.ТабРесурсов,ЭтаФорма,"Ресурсы","ТабРес","СтраницаРесурсы") Тогда 
			ЗначениеВРеквизитФормы(РезультатВыполнения.ТабРесурсов,"Ресурсы");
		КонецЕсли; 	
		
		// Вывод таблицы видов работ на форму
		Если глВывестиТЗНаФорму(РезультатВыполнения.ТабВидовРабот,ЭтаФорма,"ВидыРабот","ТабВидовРабот","СтраницаВидыРабот") Тогда 
			ЗначениеВРеквизитФормы(РезультатВыполнения.ТабВидовРабот,"ВидыРабот");
		КонецЕсли;	
		
		// Вывод таблицы коэффициентов/поправок на форму
		Если глВывестиТЗНаФорму(РезультатВыполнения.ТабПоправки,ЭтаФорма,"КоэффициентыПоправки","ТабКоэффПоправки","СтраницаПоправки") Тогда 
			ЗначениеВРеквизитФормы(РезультатВыполнения.ТабПоправки,"КоэффициентыПоправки");
		КонецЕсли;	
		
		// Вывод таблицы состава работ на форму
		Если глВывестиТЗНаФорму(РезультатВыполнения.ТабРаботы,ЭтаФорма,"СоставРабот","ТабСоставРабот","СтраницаСоставРабот") Тогда 
			ЗначениеВРеквизитФормы(РезультатВыполнения.ТабРаботы,"СоставРабот");
		КонецЕсли;	
		
		// Вывод таблицы лимитированных затрат на форму
		Если глВывестиТЗНаФорму(РезультатВыполнения.ТабЛимЗатраты,ЭтаФорма,"ЛимЗатраты","ТабЛимитированныеЗатраты","СтраницаЛимЗатраты") Тогда 
			ЗначениеВРеквизитФормы(РезультатВыполнения.ТабЛимЗатраты,"ЛимЗатраты");
		КонецЕсли;	
		
		// Вывод таблицы подписи на форму
		Если глВывестиТЗНаФорму(РезультатВыполнения.ТабПодписи,ЭтаФорма,"ТаблицаПодписи","ТабПодписиДокументов","СтраницаПодписи") Тогда 
			ЗначениеВРеквизитФормы(РезультатВыполнения.ТабПодписи,"ТаблицаПодписи");
		КонецЕсли;	

		Для Каждого ТекСтрока Из РезультатВыполнения.ТабСообщения Цикл
			Событие = НСтр("ru = 'Загрузка Гранд-смета'");
			СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие,Ложь,ТекСтрока.ТекстСообщения);
		КонецЦикла;
	
		// Свернуть таблицу соответствия ресурсов
		ТабСоответствияРес = РезультатВыполнения.ТекФорма.СоответствияРесурсов;
		ТабСоответствияРес.Свернуть("НаименованиеРесурса,КодРесурса,СсылкаВБазе");
		ЗначениеВРеквизитФормы(ТабСоответствияРес,"СоответствияРесурсов");
		
		// Свернуть таблицу соответствия лимитированных затрат
		ТабСоответствияЛЗ = РезультатВыполнения.ТекФорма.СоответствияЛЗ;
		ТабСоответствияЛЗ.Свернуть("НаименованиеЛЗ,НеЯвляетсяЛЗ,СметнаяПрограмма,СсылкаВБазе");
		ЗначениеВРеквизитФормы(ТабСоответствияЛЗ,"СоответствияЛЗ");
		
		//  Свернуть таблицу соответствия префиксов
		ТабСоответствияПрефиксов = РезультатВыполнения.ТекФорма.СоответствияПрефиксов;
		ТабСоответствияПрефиксов.Свернуть("СтрокаПрефикса,ТипНормативногоСборника,Определитель,ВидРесурса,СметнаяПрограмма,НеОтбрасыватьПрефикс,СоздаватьЗаписиВСправочнике");
		ЗначениеВРеквизитФормы(ТабСоответствияПрефиксов,"СоответствияПрефиксов");
		
		ЗначениеВРеквизитФормы(РезультатВыполнения.СведенияФайлов,"СведенияФайлов");

		Если ИзФайла Тогда
			ТипРайона = РезультатВыполнения.СведенияФайлов[0].ТипРайона;
			НаименованиеРайона = РезультатВыполнения.СведенияФайлов[0].НаименованиеРайона;
			Загрузка_СозданныйДокумент = РезультатВыполнения.СведенияФайлов[0].Загрузка_СозданныйДокумент;
			Район = РезультатВыполнения.СведенияФайлов[0].Район;
			ИмяРегиона = РезультатВыполнения.СведенияФайлов[0].ИмяРегиона;
			СметноНормативнаяБаза = РезультатВыполнения.СведенияФайлов[0].СметноНормативнаяБаза;
			НомерСметы = РезультатВыполнения.СведенияФайлов[0].НомерСметы;
			НаименованиеСметы = РезультатВыполнения.СведенияФайлов[0].НаименованиеСметы;
			Стройка = РезультатВыполнения.СведенияФайлов[0].Стройка;
			IndexesLinkMode = РезультатВыполнения.СведенияФайлов[0].IndexesLinkMode;
			IndexesMode = РезультатВыполнения.СведенияФайлов[0].IndexesMode;
			ВариантПересчетаЭММ = РезультатВыполнения.СведенияФайлов[0].ВариантПересчетаЭММ;
			ПрименятьКоэффициентыНРСП = РезультатВыполнения.СведенияФайлов[0].ПрименятьКоэффициентыНРСП;
			ТипСтроительства = РезультатВыполнения.СведенияФайлов[0].ТипСтроительства;
		КонецЕсли;

	Иначе
		ЗначениеВРеквизитФормы(РезультатВыполнения.ТабФайлов,"СведенияФайлов");
		Если ИзФайла Тогда
			Загрузка_СозданныйДокумент = РезультатВыполнения.ТабФайлов[0].Загрузка_СозданныйДокумент;
		КонецЕсли;
		Для Каждого ТекСтрока Из РезультатВыполнения.ТабСообщения Цикл
			Событие = НСтр("ru = 'Загрузка Гранд-смета'");
			СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие,Ложь,ТекСтрока.ТекстСообщения);
		КонецЦикла;
	КонецЕсли;
	Если ЭтаФорма.ЗагрузкаДанных Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Данные загружены.'"));
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документы сформированы.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзФайлаПриИзменении(Элемент)
	СтраницаФайлов();
	СведенияФайлов.Очистить();
	Загрузка_СозданныйДокумент = Неопределено;
	КаталогЗагрузки =  "";
КонецПроцедуры

&НаКлиенте
Процедура СтраницаФайлов()
	Если ИзФайла Тогда
		Элементы.ГруппаСтраницыФайлы.ТекущаяСтраница = Элементы.ГруппаСтраницыФайлы.ПодчиненныеЭлементы.СтраницаИзФайла;
	Иначе
		Элементы.ГруппаСтраницыФайлы.ТекущаяСтраница = Элементы.ГруппаСтраницыФайлы.ПодчиненныеЭлементы.СтраницаИзКаталога;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогЗагрузкиПриИзменении(Элемент)
	ОпределитьПервичныеПараметрыФайлов();
	СведенияФайлов.Очистить();
    Загрузка_СозданныйДокумент = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияФайлНажатие(Элемент)
	ИзФайла = Истина;
	ВыборФайлаКаталога(ИзФайла); 
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКаталогНажатие(Элемент)
	ИзФайла = Ложь;
	ВыборФайлаКаталога(ИзФайла);
КонецПроцедуры

&НаКлиенте
Процедура СведенияФайловПриАктивизацииЯчейки(Элемент)
	ТекЭлемент 	= Элементы.СведенияФайлов.ТекущийЭлемент;
	ТекДанные = Элементы.СведенияФайлов.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекЭлемент.Имя = "СведенияФайловЗагрузка_ТипРайона" ИЛИ ТекЭлемент.Имя = "СведенияФайловЗагрузка_Район"
		ИЛИ ТекЭлемент.Имя = "СведенияФайловЗагрузка_СметноНормативнаяБаза" ИЛИ ТекЭлемент.Имя = "СведенияФайловЗагрузка_Стройка" Тогда
		ИмяКолонки = Сред(ТекЭлемент.Имя,СтрНайти(ТекЭлемент.Имя,"_")+1);
		Если ЗначениеЗаполнено(ТекДанные[ИмяКолонки]) Тогда
			Элементы.СведенияФайлов.КоманднаяПанель.ПодчиненныеЭлементы.СведенияФайловКнопкаЗаполнитьВсе.Доступность = Истина;
			Элементы.СведенияФайлов.КоманднаяПанель.ПодчиненныеЭлементы.СведенияФайловКнопкаЗаполнитьПустые.Доступность = Истина;
		Иначе
			Элементы.СведенияФайлов.КоманднаяПанель.ПодчиненныеЭлементы.СведенияФайловКнопкаЗаполнитьВсе.Доступность = Ложь;
			Элементы.СведенияФайлов.КоманднаяПанель.ПодчиненныеЭлементы.СведенияФайловКнопкаЗаполнитьПустые.Доступность = Ложь;
		КонецЕсли;
	Иначе
		Элементы.СведенияФайлов.КоманднаяПанель.ПодчиненныеЭлементы.СведенияФайловКнопкаЗаполнитьВсе.Доступность = Ложь;
		Элементы.СведенияФайлов.КоманднаяПанель.ПодчиненныеЭлементы.СведенияФайловКнопкаЗаполнитьПустые.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсе(Команда)
	ТекЭлемент 	= Элементы.СведенияФайлов.ТекущийЭлемент;
	ТекДанные = Элементы.СведенияФайлов.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекЭлемент.Имя = "СведенияФайловЗагрузка_ТипРайона" ИЛИ ТекЭлемент.Имя = "СведенияФайловЗагрузка_Район"
		ИЛИ ТекЭлемент.Имя = "СведенияФайловЗагрузка_СметноНормативнаяБаза" ИЛИ ТекЭлемент.Имя = "СведенияФайловЗагрузка_Стройка" Тогда
		ИмяКолонки = Сред(ТекЭлемент.Имя,СтрНайти(ТекЭлемент.Имя,"_")+1);
		ТекЗначение = ТекДанные[ИмяКолонки];
		Для Каждого стр из СведенияФайлов Цикл
			стр[ИмяКолонки] = ТекЗначение;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПустые(Команда)
	ТекЭлемент 	= Элементы.СведенияФайлов.ТекущийЭлемент;
	ТекДанные = Элементы.СведенияФайлов.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекЭлемент.Имя = "СведенияФайловЗагрузка_ТипРайона" ИЛИ ТекЭлемент.Имя = "СведенияФайловЗагрузка_Район"
		ИЛИ ТекЭлемент.Имя = "СведенияФайловЗагрузка_СметноНормативнаяБаза" ИЛИ ТекЭлемент.Имя = "СведенияФайловЗагрузка_Стройка" Тогда
		ИмяКолонки = Сред(ТекЭлемент.Имя,СтрНайти(ТекЭлемент.Имя,"_")+1);
		ТекЗначение = ТекДанные[ИмяКолонки];
		Для Каждого стр из СведенияФайлов Цикл
			Если ЗначениеЗаполнено(стр[ИмяКолонки]) Тогда
				Продолжить;
			КонецЕсли;
			стр[ИмяКолонки] = ТекЗначение;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКнопок()
	Элементы.ЗагрузитьXML.Видимость = (СостояниеКнопок <> 2);
	Элементы.СформироватьДокументы.Видимость = (СостояниеКнопок = 2);
	Элементы.Состояние2.Видимость = СостояниеКнопок = 3;
	Элементы.Состояние3.Видимость = СостояниеКнопок = 2;
	Элементы.ГруппаВыборФайла.Доступность = (СостояниеКнопок <> 2);
	Элементы.КаталогЗагрузки.Доступность = (СостояниеКнопок <> 2);
	
	Элементы.ЗагрузитьXML.КнопкаПоУмолчанию 			= Элементы.ЗагрузитьXML.Видимость;
	Элементы.СформироватьДокументы.КнопкаПоУмолчанию 	= Элементы.СформироватьДокументы.Видимость;

КонецПроцедуры

&НаКлиенте
Процедура Состояние3Нажатие(Элемент)
	СостояниеКнопок = 1;
	ВидимостьКнопок();
КонецПроцедуры

&НаКлиенте
Процедура Состояние2Нажатие(Элемент)
	СостояниеКнопок = 2;
	ВидимостьКнопок();
КонецПроцедуры

&НаКлиенте
Процедура СведенияФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СведенияФайловЗагрузка_СозданныйДокумент" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Загрузка_СозданныйДокумент) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Загрузка_СозданныйДокумент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутьСохраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите каталог'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ПутьСохранения = ДиалогОткрытияФайла.Каталог;
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ОтборСметЛокальнаяСметаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеОЗакрытииФормыВыбораЛС = Новый ОписаниеОповещения("ПриЗакрытииФормыПодбораЛС",ЭтаФорма);
	ОткрытьФорму("Обработка.СМ_ДеревоСметПростое.Форма.ФормаУпр",,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораЛС,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыПодбораЛС(ТекЛС,ТекПараметр) Экспорт
	Если ТекЛС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ОтборСмет.ТекущиеДанные.ЛокальнаяСмета = ТекЛС;
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	// Возврат;
	#Если Не ВебКлиент Тогда
		Если Не ЗначениеЗаполнено(Объект.ПутьСохранения) Тогда
			ПоказатьПредупреждение(,НСтр("ru='Не выбран каталог!'"));
			Возврат;
		КонецЕсли;
     	АдресФайлаВоВременномХранилище = "";
		ВыгрузитьНаСервер(АдресФайлаВоВременномХранилище);
		
		Для Каждого ключ Из АдресФайлаВоВременномХранилище Цикл
			ПолучитьФайл(ключ.Значение,Объект.ПутьСохранения+ключ.Ключ,Ложь);
		КонецЦикла;

	#КонецЕсли

	#Если ВебКлиент Тогда
		Оповещение = Новый ОписаниеОповещения("ПродолжитьНачатьПодключениеРасширенияРаботыСФайлами", ЭтаФорма);
		НачатьПодключениеРасширенияРаботыСФайлами(Оповещение) ;
	#КонецЕсли

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выгрузка завершена...'"));
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьНачатьПодключениеРасширенияРаботыСФайлами(Подключено,ДополнительныеПараметры) Экспорт
	Если Не Подключено Тогда
		Оповещение = Новый ОписаниеОповещения("ПродолжитьНачатьУстановкуРасширения", ЭтаФорма);
		НачатьУстановкуРасширенияРаботыСФайлами(Оповещение);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПродолжитьВыгрузкуВеб", ЭтаФорма);
		НачатьПолучениеКаталогаДокументов(Оповещение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьНачатьУстановкуРасширения(ДополнительныеПараметры) Экспорт
	Оповещение = Новый ОписаниеОповещения("ПродолжитьВыгрузкуВеб", ЭтаФорма);
	НачатьПолучениеКаталогаДокументов(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыгрузкуВеб(ИмяКаталогаДокументов,ДополнительныеПараметры) Экспорт
	ВыгрузитьНаСерверВеб(ИмяКаталогаДокументов);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервер(АдресФайлаВоВременномХранилище)
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	Обработки.СМ_ОбменДаннымиВФорматеГрандСмета.ВыгрузитьНаСервере(Объект.ПутьСохранения,Объект.ОтборСмет.Выгрузить().ВыгрузитьКолонку("ЛокальнаяСмета"),АдресФайлаВоВременномХранилище,ИмяВременногоФайла);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСерверВеб(Адрес)
	ОбъектДляСервера = РеквизитФормыВЗначение("Объект");
	Обработки.СМ_ОбменДаннымиВФорматеГрандСмета.ВыгрузитьНаСервере(Адрес,Объект.ОтборСмет.Выгрузить().ВыгрузитьКолонку("ЛокальнаяСмета"),,Истина);
КонецПроцедуры

&НаКлиенте
Процедура СоответствияЛЗСсылкаВБазеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПолучитьЛимитированныеЗатраты", ЭтотОбъект);
	ОткрытьФорму("Справочник.СМ_ЛимитированныеЗатраты.Форма.ФормаВыбораБезПомеченныхНаУдаление",,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЛимитированныеЗатраты(Результат, Структура) Экспорт
	
	Элементы.СоответствияЛЗ.ТекущиеДанные.СсылкаВБазе = Результат;

КонецПроцедуры


#КонецОбласти
